app/controllers/picture_controller.rb

   def show
	puts("show params", params)

     @pothole = Pothole.find(params[:pothole_id])
---
SELECT  "potholes".* FROM "potholes" WHERE "potholes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def mystore
    up_file = params[:localfile]
puts("up_file", up_file)
	pothole_id = params[:pothole_id]
puts("pothole_id", pothole_id)
     myfile = MyuploaderUploader.new()
     myfile.store!(up_file)
	# puts("111111111111111111111111111111")
	path = myfile.to_s
	# puts(s)
	@newpicture = Picture.new(:path => path, :pothole_id => pothole_id )
	@newpicture.save
---
INSERT INTO "pictures" ("path", "pothole_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["path", "/uploads/nil_class/3/5.jpg"], ["pothole_id", 7], ["created_at", "2018-12-19 03:29:32.464636"], ["updated_at", "2018-12-19 03:29:32.464636"]]