app/controllers/potholes_controller.rb

  def index
    @potholes = Pothole.all
---
SELECT "potholes".* FROM "potholes"

  def create
    @pothole = Pothole.new(pothole_params)

    respond_to do |format|
      if @pothole.save
---
INSERT INTO "potholes" ("streetAdress", "size", "location", "district", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["streetAdress", "1234"], ["size", 12], ["location", "2141213"], ["district", "4214124214124122142"], ["created_at", "2018-12-17 01:37:07.866047"], ["updated_at", "2018-12-17 01:37:07.866047"]]

  def update
    respond_to do |format|
      if @pothole.update(pothole_params)
---
UPDATE "potholes" SET "location" = ?, "updated_at" = ? WHERE "potholes"."id" = ?  [["location", "wer"], ["updated_at", "2018-12-17 17:03:38.757505"], ["id", 4]]

  def destroy
    @pothole.destroy
---
DELETE FROM "potholes" WHERE "potholes"."id" = ?  [["id", 1]]

    def set_pothole
      @pothole = Pothole.find(params[:id])
---
SELECT  "potholes".* FROM "potholes" WHERE "potholes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]